PROJECT_NAME = "TexTuneS"
PROJECT_ICON = "🎶"


# 프로젝트 설명
PROJECT_DETAIL = """
# 🎶 Make Your Creative Music 🎶
## 크리에이터를 위한 맞춤형 음악생성 서비스
##### 배경음악은 이미 다양한 컨텐츠 속에서 활용되고 있으며, 이는 더 몰입할 수 있는 환경을 제공하고 있습니다.
##### 배경음악을 다양한 컨텐츠에 활용하고 싶은 모든 크리에이터들을 위해 누구나 쉽고 간단하게 나만의 맞춤형 배경음악을 만들어주는 경험을 제공합니다.
##### 음악 생성 모델을 활용하여 배경음악을 만들고 다양한 컨텐츠를 더 완성도 높게 만들어 보세요.
    """

MAIN_SIMPLE_CATEGORY = """
## Simple-Category | 간단하게 음악을 생성해 보세요!
----
##### 대표적인 `장르`와 `분위기`, `악기`로 음악을 만들어 보세요!
##### 클릭만으로 쉽고 간단하게 음악을 생성할 수 있습니다.

"""

MAIN_EXTRA_CATEGORY = """
## Extra-Category | 좀 더 다양하게
----
##### 수많은 카테고리 속에서 다양한 음악을 생성해 보세요!
##### simple-category보다 더 풍부한 장르, 분위기, 악기가 준비돼있습니다.
##### 카테고리 `검색기능`을 사용해서 쉽게 카테고리를 찾을 수 있습니다.
##### 만약 원하는 카테고리가 없다면? `시용자 키워드`에 자신만의 `음악 키워드`를 추가할 수 있습니다. 
##### [장르], [분위기], [악기] 뿐만 아니라, [감정], [테마], [상황] 등...  `음악 키워드`는 뭐든지 가능합니다.
##### `시용자 키워드`에 자신이 원하는 음악의 다양한 정보를 담아주세요!
##### `시용자 키워드`는 한글과 영어 모두 사용 가능합니다
"""

MAIN_TEXT_ANALYSIS = """
## Text-Analysis | 텍스트와 어울리는 음악
----
##### 자신의 글\t(blog, 소설, 시, ...)에 어울리는 음악을 생성해 보세요!
##### `시용자 키워드`에 자신만의 `음악 키워드`를 추가할 수 있습니다.
##### [장르], [분위기], [악기] 뿐만 아니라, [감정], [테마], [상황] 등...  `음악 키워드`는 뭐든지 가능합니다.
##### `시용자 키워드`에 자신이 원하는 음악의 다양한 정보를 담아주세요!
##### `시용자 키워드`는 한글과 영어 모두 사용 가능합니다
"""

SIMPLE_CATEGORY_GUIDE = """
### 😊 "Simple Category"는 간단하게 원하는 정보를 선택하여 배경 음악을 생성하는 방식입니다.
1. 원하는 `장르`와 `분위기`, `악기`를 선택해 주세요. **원하는 만큼 선택이 가능합니다.**  
2. 카테고리 외에 추가하고 싶은 키워드가 있다면 `시용자 키워드`에 추가해 주세요  
3. 마지막으로, 음악의 `재생시간`과 `속도`를 선택하고 Submit 버튼을 눌러주세요!!  

💢 주의 ) 초기화 버튼을 누르면 선택한 모든 카테고리가 사라집니다!!  
"""

EXTRA_CATEGORY_GUIDE = """
### 😊 "Extra Category"는 더 많은 카테고리 중에서 원하는 정보를 선택하여 배경 음악을 생성하는 방식입니다.
1. 원하는 `장르`와 `분위기`, `악기`를 선택해 주세요.**원하는 만큼 선택이 가능합니다.**  
2. 카테고리 외에 추가하고 싶은 키워드가 있다면 `시용자 키워드`에 추가해 주세요  
3. 마지막으로, 음악의 `재생시간`과 `속도`를 선택하고 Submit 버튼을 눌러주세요!!  

💢 주의 ) 초기화 버튼을 누르면 선택한 모든 카테고리가 사라집니다!!  
"""

TEXT_ANALYSIS_GUIDE = """
### 😊 "Text Analysis"는 텍스트를 입력하면 분석하여 맞춤형 배경 음악을 생성하는 방식입니다.
1. 음악을 생성하고 싶은 텍스트를 입력해주세요!!  
2. 혹시 음악에 추가하고 싶은 키워드가 있다면 `시용자 키워드`에 추가해 주세요  
3. 마지막으로, 음악의 `재생시간`과 `속도`를 선택하고 Submit 버튼을 눌러주세요!!  

💢 주의 ) 초기화 버튼을 누르면 선택한 모든 카테고리가 사라집니다!!  
"""

ETC_EXAMPLE = "※　예시 )　Calm music, smooth jazz, 별헤는 밤, Funny music, Children music, christmas music, 눈 내리는 아침"
